---
type: ParameterDownloadOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ParameterDownloadOptions

`Autodesk.Revit.DB.ParameterDownloadOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ParameterDownloadOptions | — | `` |
| Constructor | ParameterDownloadOptions | 2024 | `public ParameterDownloadOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCategories | 2024 | `public ISet < ElementId > GetCategories ()` |
| Method | GetGroupTypeId | 2024 | `public ForgeTypeId GetGroupTypeId ()` |
| Method | SetCategories | 2024 | `public void SetCategories ( ISet < ElementId > categories )` |
| Method | SetGroupTypeId | 2024 | `public void SetGroupTypeId ( ForgeTypeId groupTypeId )` |
| Property | IsInstance | 2024 | `public bool IsInstance { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Visible | 2024 | `public bool Visible { get ; set ; }` |